Model: "HRNet"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 500, 500, 3) 0                                            
__________________________________________________________________________________________________
First_conv2D (Conv2D)           (None, 500, 500, 32) 896         input_1[0][0]                    
__________________________________________________________________________________________________
First_BN (BatchNormalization)   (None, 500, 500, 32) 128         First_conv2D[0][0]               
__________________________________________________________________________________________________
First_RELU (ReLU)               (None, 500, 500, 32) 0           First_BN[0][0]                   
__________________________________________________________________________________________________
Res_maxpool_1 (MaxPooling2D)    (None, 250, 250, 32) 0           First_RELU[0][0]                 
__________________________________________________________________________________________________
Res_conv2D_first1 (Conv2D)      (None, 250, 250, 64) 18496       Res_maxpool_1[0][0]              
__________________________________________________________________________________________________
Res_BN_first1 (BatchNormalizati (None, 250, 250, 64) 256         Res_conv2D_first1[0][0]          
__________________________________________________________________________________________________
Res_ReLU_first1 (ReLU)          (None, 250, 250, 64) 0           Res_BN_first1[0][0]              
__________________________________________________________________________________________________
Res_conv2D_second1 (Conv2D)     (None, 250, 250, 64) 36928       Res_ReLU_first1[0][0]            
__________________________________________________________________________________________________
Res_poolSKIP_1 (MaxPooling2D)   (None, 250, 250, 32) 0           First_RELU[0][0]                 
__________________________________________________________________________________________________
Res_BN_second1 (BatchNormalizat (None, 250, 250, 64) 256         Res_conv2D_second1[0][0]         
__________________________________________________________________________________________________
Res_conv2DSKIP_1 (Conv2D)       (None, 250, 250, 64) 2112        Res_poolSKIP_1[0][0]             
__________________________________________________________________________________________________
Res_ReLU_second1 (ReLU)         (None, 250, 250, 64) 0           Res_BN_second1[0][0]             
__________________________________________________________________________________________________
add (Add)                       (None, 250, 250, 64) 0           Res_conv2DSKIP_1[0][0]           
                                                                 Res_ReLU_second1[0][0]           
__________________________________________________________________________________________________
Res_conv2D_first2 (Conv2D)      (None, 250, 250, 64) 36928       add[0][0]                        
__________________________________________________________________________________________________
Res_BN_first2 (BatchNormalizati (None, 250, 250, 64) 256         Res_conv2D_first2[0][0]          
__________________________________________________________________________________________________
Res_ReLU_first2 (ReLU)          (None, 250, 250, 64) 0           Res_BN_first2[0][0]              
__________________________________________________________________________________________________
Res_conv2D_second2 (Conv2D)     (None, 250, 250, 64) 36928       Res_ReLU_first2[0][0]            
__________________________________________________________________________________________________
Res_BN_second2 (BatchNormalizat (None, 250, 250, 64) 256         Res_conv2D_second2[0][0]         
__________________________________________________________________________________________________
Res_conv2DSKIP_2 (Conv2D)       (None, 250, 250, 64) 4160        add[0][0]                        
__________________________________________________________________________________________________
Res_ReLU_second2 (ReLU)         (None, 250, 250, 64) 0           Res_BN_second2[0][0]             
__________________________________________________________________________________________________
add_1 (Add)                     (None, 250, 250, 64) 0           Res_conv2DSKIP_2[0][0]           
                                                                 Res_ReLU_second2[0][0]           
__________________________________________________________________________________________________
Res_maxpool_3 (MaxPooling2D)    (None, 125, 125, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
Res_conv2D_first3 (Conv2D)      (None, 125, 125, 128 73856       Res_maxpool_3[0][0]              
__________________________________________________________________________________________________
Res_BN_first3 (BatchNormalizati (None, 125, 125, 128 512         Res_conv2D_first3[0][0]          
__________________________________________________________________________________________________
Res_ReLU_first3 (ReLU)          (None, 125, 125, 128 0           Res_BN_first3[0][0]              
__________________________________________________________________________________________________
Res_conv2D_second3 (Conv2D)     (None, 125, 125, 128 147584      Res_ReLU_first3[0][0]            
__________________________________________________________________________________________________
Res_poolSKIP_3 (MaxPooling2D)   (None, 125, 125, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
Res_BN_second3 (BatchNormalizat (None, 125, 125, 128 512         Res_conv2D_second3[0][0]         
__________________________________________________________________________________________________
Res_conv2DSKIP_3 (Conv2D)       (None, 125, 125, 128 8320        Res_poolSKIP_3[0][0]             
__________________________________________________________________________________________________
Res_ReLU_second3 (ReLU)         (None, 125, 125, 128 0           Res_BN_second3[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 125, 125, 128 0           Res_conv2DSKIP_3[0][0]           
                                                                 Res_ReLU_second3[0][0]           
__________________________________________________________________________________________________
Res_conv2D_first4 (Conv2D)      (None, 125, 125, 128 147584      add_2[0][0]                      
__________________________________________________________________________________________________
Res_BN_first4 (BatchNormalizati (None, 125, 125, 128 512         Res_conv2D_first4[0][0]          
__________________________________________________________________________________________________
Res_ReLU_first4 (ReLU)          (None, 125, 125, 128 0           Res_BN_first4[0][0]              
__________________________________________________________________________________________________
Res_conv2D_second4 (Conv2D)     (None, 125, 125, 128 147584      Res_ReLU_first4[0][0]            
__________________________________________________________________________________________________
Res_BN_second4 (BatchNormalizat (None, 125, 125, 128 512         Res_conv2D_second4[0][0]         
__________________________________________________________________________________________________
Res_conv2DSKIP_4 (Conv2D)       (None, 125, 125, 128 16512       add_2[0][0]                      
__________________________________________________________________________________________________
Res_ReLU_second4 (ReLU)         (None, 125, 125, 128 0           Res_BN_second4[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 125, 125, 128 0           Res_conv2DSKIP_4[0][0]           
                                                                 Res_ReLU_second4[0][0]           
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 125, 125, 102 1180672     add_3[0][0]                      
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 500, 500, 64) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
Last_conv2D (Conv2D)            (None, 500, 500, 3)  1731        lambda[0][0]                     
==================================================================================================
Total params: 1,863,491
Trainable params: 1,861,891
Non-trainable params: 1,600
__________________________________________________________________________________________________
